Extensions/БИТ_Доработки_НДЭ/DataProcessors/СписокФасовокПоЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СписокФасовокПоЗаказу</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаФасовок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Фасовка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументовФасовка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЧастьКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БИТ_КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/СпецификацииПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпецификацииПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Documents/Фасовка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Фасовка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФасовка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЧастьКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БИТ_КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоМатериал</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Спецификации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/DataProcessors/СписокФасовокПоЗаказу/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Заказ = Параметры.ЗаказОснование;
    Объект.ЗаказОснование = Заказ;
    Объект.Организация = Параметры.Организация;
    
    // Очищаем таблицу
    Объект.ТаблицаФасовок.Очистить();
    
    // Загружаем данные из базы с учетом табличной части
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Фасовка.Ссылка КАК Ссылка,
    |	ФасовкаПродукция.Номенклатура КАК Номенклатура,
    |	ФасовкаПродукция.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ФасовкаПродукция.Количество КАК Количество,
    |	Фасовка.Сотрудник КАК Сотрудник,
    |	Фасовка.СтатусДокумента КАК Статус,
    |	Фасовка.Станок КАК Станок,
    |	ФасовкаПродукция.КоличествоФакт КАК КоличествоФакт,
    |	ФасовкаПродукция.Штрихкод КАК Штрихкод
    |ИЗ
    |	Документ.Фасовка КАК Фасовка
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Фасовка.Продукция КАК ФасовкаПродукция
    |		ПО Фасовка.Ссылка = ФасовкаПродукция.Ссылка
    |ГДЕ
    |	Фасовка.ДокументОснование = &Заказ
    |	И ФасовкаПродукция.ЭтоМатериал = ЛОЖЬ
    |	И Фасовка.ПометкаУдаления = ЛОЖЬ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Фасовка.Ссылка,
    |	ФасовкаПродукция.Номенклатура";
    
    Запрос.УстановитьПараметр("Заказ", Заказ);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.ТаблицаФасовок.Добавить();
        НоваяСтрока.Отметка = Ложь;
        НоваяСтрока.Ссылка = Выборка.Ссылка;
        НоваяСтрока.Номенклатура = Выборка.Номенклатура;
        НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
        НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.КоличествоФакт = Выборка.КоличествоФакт;
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.Статус = Выборка.Статус;
        НоваяСтрока.Станок = Выборка.Станок;
		//НоваяСтрока.ЭтоЧастьКомплектации = Выборка.ЭтоЧастьКомплектации;
		//НоваяСтрока.БИТ_КлючСтроки = Выборка.БИТ_КлючСтроки;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФасовокПриИзменении(Элемент)
    
    // Сохраняем индекс измененной строки
    ТекущаяСтрока = Элементы.ТаблицаФасовок.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Отмечаем строку как измененную
    ТекущаяСтрока.Отметка = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
    ИзмененныеСтроки = КакиеСтрокиИзменены();
    Если ИзмененныеСтроки.Количество() = 0 Тогда
        ПоказатьПредупреждение(, "Нет изменений для сохранения");
        Возврат;
    КонецЕсли;
    
    // Сохраняем все измененные строки
    СохранитьВсеИзмененияНаСервере(ИзмененныеСтроки);
    
    Сообщить("Изменения сохранены!");
    
КонецПроцедуры

&НаСервере
Функция КакиеСтрокиИзменены()
    МассивИзмененных = Новый Массив;
    Для Каждого Строка Из Объект.ТаблицаФасовок Цикл
        Если Строка.Отметка = Истина Тогда
            МассивИзмененных.Добавить(Объект.ТаблицаФасовок.Индекс(Строка));
        КонецЕсли;
    КонецЦикла;
    Возврат МассивИзмененных;
КонецФункции

&НаСервере
Процедура СохранитьВсеИзмененияНаСервере(ИзмененныеСтроки)
    
    Для каждого Индекс Из ИзмененныеСтроки Цикл
        СтрокаТаблицы = Объект.ТаблицаФасовок[Индекс];
        
        // Получаем объект документа
        ДокументОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
        Если ДокументОбъект = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        
        // Флаг, были ли изменения
        Изменено = Ложь;
        
        Если ДокументОбъект.Сотрудник <> СтрокаТаблицы.Сотрудник Тогда
            ДокументОбъект.Сотрудник = СтрокаТаблицы.Сотрудник;
            Изменено = Истина;
        КонецЕсли;
        
        Если ДокументОбъект.СтатусДокумента <> СтрокаТаблицы.Статус Тогда
            ДокументОбъект.СтатусДокумента = СтрокаТаблицы.Статус;
            Изменено = Истина;
        КонецЕсли;
        
        Если ДокументОбъект.Станок <> СтрокаТаблицы.Станок Тогда
            ДокументОбъект.Станок = СтрокаТаблицы.Станок;
            Изменено = Истина;
        КонецЕсли;
		
		ИзменитьКоличествоУСырьяСпецификации = Ложь;
		ИзменитьКоличествоФактУСырьяСпецификации = Ложь;
        // Обновляем данные в табличной части "Продукция"
        Для каждого СтрокаТЧ Из ДокументОбъект.Продукция Цикл
            Если СтрокаТЧ.Номенклатура = СтрокаТаблицы.Номенклатура Тогда
				Если СтрокаТЧ.Количество <> СтрокаТаблицы.Количество Тогда
					//еще нужно изменение количества у сырья (первой строки спецификации)
					//находим эту строку 
		            ИзменитьКоличествоУСырьяСпецификации = Истина;
                    СтрокаТЧ.Количество = СтрокаТаблицы.Количество;
                    Изменено = Истина;
                КонецЕсли;
                Если СтрокаТЧ.ЕдиницаИзмерения <> СтрокаТаблицы.ЕдиницаИзмерения Тогда
                    СтрокаТЧ.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
                    Изменено = Истина;
				КонецЕсли;
				Если СтрокаТЧ.КоличествоФакт <> СтрокаТаблицы.КоличествоФакт Тогда
					ИзменитьКоличествоФактУСырьяСпецификации = Истина;
                    СтрокаТЧ.КоличествоФакт = СтрокаТаблицы.КоличествоФакт;
                    Изменено = Истина;
                КонецЕсли;
                Прервать;
            КонецЕсли;
		КонецЦикла;
		
		
		СтрокаСырья = НайтиСырьеПоСпецификации(СтрокаТаблицы.Номенклатура);
		Если СтрокаСырья = Неопределено Тогда
			Сообщить("Не найдена спецификация для " + Строка(СтрокаТаблицы.Номенклатура.Наименование)); 
			Возврат;
		КонецЕСли;
		Если ИзменитьКоличествоУСырьяСпецификации Тогда
			Для каждого СтрокаТЧ Из ДокументОбъект.Продукция Цикл
				Если СтрокаТЧ.Номенклатура = СтрокаСырья.Номенклатура Тогда
					СтрокаТЧ.Количество = СтрокаСырья.Количество*СтрокаТаблицы.Количество;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ИзменитьКоличествоФактУСырьяСпецификации Тогда
			Для каждого СтрокаТЧ Из ДокументОбъект.Продукция Цикл
				Если СтрокаТЧ.Номенклатура = СтрокаСырья.Номенклатура Тогда
					СтрокаТЧ.КоличествоФакт = СтрокаСырья.Количество*СтрокаТаблицы.КоличествоФакт;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
        // Записываем изменения, если они были
        Если Изменено Тогда
			Попытка
				ДокументОбъект.Дата = ТекущаяДата();
                ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
                Сообщить("Документ изменен: " + ДокументОбъект.Ссылка);
            Исключение
                Сообщить("Ошибка при сохранении документа: " + ОписаниеОшибки());
            КонецПопытки;
        КонецЕсли;
        
    КонецЦикла;
    
    // Снимаем отметки об изменении
    Для каждого Строка Из Объект.ТаблицаФасовок Цикл
        Строка.Отметка = Ложь;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция НайтиСырьеПоСпецификации(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	СпецификацииСостав.Номенклатура КАК Номенклатура,
	    |	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	    |	СпецификацииСостав.Количество КАК Количество
	    |ИЗ
	    |	РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Спецификации.Состав КАК СпецификацииСостав
	    |		ПО СпецификацииПоУмолчанию.Спецификация = СпецификацииСостав.Ссылка
	    |ГДЕ
	    |	СпецификацииСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	    |	И СпецификацииСостав.Ссылка.Недействителен = ЛОЖЬ
	    |	И СпецификацииПоУмолчанию.Номенклатура = &Номенклатура";
	    
	    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	    Результат = Запрос.Выполнить();
	    Выборка = Результат.Выбрать();
	    
		Если Выборка.Следующий() Тогда
			Возврат Выборка;
		КонецЕсли;
		Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОбновитьСписок(Команда)
    
    // Перезагружаем данные из базы
    ОбновитьДанныеНаСервере();
    
    Сообщить("Список обновлен");
    
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
    
    // Перезаполняем таблицу свежими данными
    Объект.ТаблицаФасовок.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Фасовка.Ссылка КАК Ссылка,
    |	ФасовкаПродукция.Номенклатура КАК Номенклатура,
    |	ФасовкаПродукция.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ФасовкаПродукция.Количество КАК Количество,
    |	Фасовка.Сотрудник КАК Сотрудник,
    |	Фасовка.СтатусДокумента КАК Статус,
    |	Фасовка.Станок КАК Станок,
    |	ФасовкаПродукция.КоличествоФакт КАК КоличествоФакт
    |ИЗ
    |	Документ.Фасовка КАК Фасовка
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Фасовка.Продукция КАК ФасовкаПродукция
    |		ПО Фасовка.Ссылка = ФасовкаПродукция.Ссылка
    |ГДЕ
    |	Фасовка.ДокументОснование = &Заказ
    |	И ФасовкаПродукция.ЭтоМатериал = ЛОЖЬ
    |	И Фасовка.ПометкаУдаления = ЛОЖЬ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Фасовка.Ссылка,
    |	ФасовкаПродукция.Номенклатура";
    
    Запрос.УстановитьПараметр("Заказ", Объект.ЗаказОснование);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.ТаблицаФасовок.Добавить();
        НоваяСтрока.Отметка = Ложь;
        НоваяСтрока.Ссылка = Выборка.Ссылка;
        НоваяСтрока.Номенклатура = Выборка.Номенклатура;
        НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
        НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.КоличествоФакт = Выборка.КоличествоФакт;
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.Статус = Выборка.Статус;
        НоваяСтрока.Станок = Выборка.Станок;
		//НоваяСтрока.ЭтоЧастьКомплектации = Выборка.ЭтоЧастьКомплектации;
		//НоваяСтрока.БИТ_КлючСтроки = Выборка.БИТ_КлючСтроки;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
    Закрыть();
КонецПроцедуры
